NAT#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
NAT(config)#ip nat pool internetip 24.24.1.3 24.24.1.6 netmask 255.255.255.248
NAT(config)#access-list  ?
  <1-99>     IP standard access list
  <100-199>  IP extended access list
NAT(config)#access-list 99 permit 10.0.0.0 0.255.255.255
NAT(config)#access-list 99 deny any 
NAT(config)#ip nat inside source list 99 pool internetip 

NAT#show ip nat tr 
Pro  Inside global     Inside local       Outside local      Outside global
tcp 24.24.1.3:1026     10.16.0.2:1026     66.249.81.104:80   66.249.81.104:80

NAT#clear ip nat translation *
NAT#conf t 
Enter configuration commands, one per line.  End with CNTL/Z.
NAT(config)#ip nat inside source list 99 pool internetip overload 
NAT(config)#do show ip nat tran 
Pro  Inside global     Inside local       Outside local      Outside global
tcp 24.24.1.4:1027     10.16.0.2:1027     66.249.81.104:80   66.249.81.104:80
tcp 24.24.1.4:1026     10.16.0.3:1026     66.249.81.104:80   66.249.81.104:80
